telia/ServiceInteractions/riv/clinicalprocess/activity/order/trunk/docs/examples/Example_ProcessActivityOrder_blood_pressure.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:activity:notification:ActivityOrderNotificationResponder:1" xmlns:urn2="urn:riv:clinicalprocess:activity:notification:1">
   <soapenv:Header>
      <urn:LogicalAddress>112233</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:ActivityOrderNotification>
         <urn1:activityOrder>
            <urn2:id>
               <urn2:root>?</urn2:root>
               <urn2:extension>?</urn2:extension>
            </urn2:id>
            <urn2:type>
               <urn2:code>27113001</urn2:code>
               <urn2:codeSystem>1.2.752.116.2.1.1</urn2:codeSystem>
            </urn2:type>
            <urn2:status>NEW</urn2:status>
            <urn2:sourceSystemHSAId>
               <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
               <urn2:extension></urn2:extension>
            </urn2:sourceSystemHSAId>
            <urn2:typeOfTransfer>PUSH</urn2:typeOfTransfer>
            <urn2:comment>Some comment from profession system to user.</urn2:comment>
            <urn2:signDateTime>20140101120100</urn2:signDateTime>
            <urn2:registerDateTime>20140101120100</urn2:registerDateTime>
            <urn2:timePeriod>
               <urn2:start>20140101120100</urn2:start>
               <urn2:end>20140101120200</urn2:end>
            </urn2:timePeriod>
            <urn2:device>
               <urn2:id>
                  <urn2:root>?</urn2:root>
                  <urn2:extension>?</urn2:extension>
               </urn2:id>
               <urn2:type>
                  <urn2:code>?</urn2:code>
                  <urn2:codeSystem>?</urn2:codeSystem>
                  <urn2:codeSystemName>?</urn2:codeSystemName>
                  <urn2:codeSystemVersion>?</urn2:codeSystemVersion>
                  <urn2:displayName>?</urn2:displayName>
               </urn2:type>
               <urn2:model>
                  <urn2:code>
                     <urn2:code>?</urn2:code>
                     <urn2:codeSystem>?</urn2:codeSystem>
                     <urn2:codeSystemName>?</urn2:codeSystemName>
                     <urn2:codeSystemVersion>?</urn2:codeSystemVersion>
                     <urn2:displayName>?</urn2:displayName>
                  </urn2:code>
                  <urn2:value>?</urn2:value>
               </urn2:model>
            </urn2:device>
            <urn2:patient>
               <urn2:patientId>
                  <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
                  <urn2:extension>7601011212</urn2:extension>
               </urn2:patientId>
               <urn2:consent>true</urn2:consent>
            </urn2:patient>
            <urn2:participant>
               <urn2:patient>
                  <urn2:patientId>
                     <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
                  <urn2:extension>7601011212</urn2:extension>
                  </urn2:patientId>
                  <urn2:consent>true</urn2:consent>
               </urn2:patient>
               <urn2:healthcareProfessional>
                  <urn2:id>
                     <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                     <urn2:extension>SE-ABC1234</urn2:extension>
                  </urn2:id>
                  <urn2:firstName>first name</urn2:firstName>
                  <urn2:lastName>last name</urn2:lastName>
                  <urn2:organisation>
                     <urn2:id>
                        <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                        <urn2:extension>SE-100123</urn2:extension>
                     </urn2:id>
                  </urn2:organisation>
               </urn2:healthcareProfessional>
               <urn2:organisation>
                  <urn2:id>
                     <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                     <urn2:extension>SE-100123</urn2:extension>
                  </urn2:id>
               </urn2:organisation>
            </urn2:participant>
         </urn1:activityOrder>
      </urn1:ActivityOrderNotification>
   </soapenv:Body>
</soapenv:Envelope>
